"use strict";

namespace SubGenreModule {
    let subGenreTable = {
        0: {
            16: "すべて"
        },
        1: {
            16: "すべて",
            0: "定時・総合",
            1: "天気",
            2: "特集・ドキュメント",
            3: "政治・国会",
            4: "経済・市況",
            5: "海外・国際",
            6: "解説",
            7: "討論・会談",
            8: "報道特番",
            9: "ローカル・地域",
            10: "交通",
            15: "その他"
        },
        2: {
            16: "すべて",
            0: "スポーツニュース",
            1: "野球",
            2: "サッカー",
            3: "ゴルフ",
            4: "その他の球技",
            5: "相撲・格闘技",
            6: "オリンピック・国際大会",
            7: "マラソン・陸上・水泳",
            8: "モータースポーツ",
            9: "マリン・ウィンタースポーツ",
            10: "競馬・公営競技",
            15: "その他"
        },
        3: {
            16: "すべて",
            0: "芸能・ワイドショー",
            1: "ファッション",
            2: "暮らし・住まい",
            3: "健康・医療",
            4: "ショッピング・通販",
            5: "グルメ・料理",
            6: "イベント",
            7: "番組紹介・お知らせ",
            15: "その他"
        },
        4: {
            16: "すべて",
            0: "国内ドラマ",
            1: "海外ドラマ",
            2: "時代劇",
            15: "その他"
        },
        5: {
            16: "すべて",
            0: "国内ロック・ポップス",
            1: "海外ロック・ポップス",
            2: "クラシック・オペラ",
            3: "ジャズ・フュージョン",
            4: "歌謡曲・演歌",
            5: "ライブ・コンサート",
            6: "ランキング・リクエスト",
            7: "カラオケ・のど自慢",
            8: "民謡・邦楽",
            9: "童謡・キッズ",
            10: "民族音楽・ワールドミュージック",
            15: "その他"
        },
        6: {
            16: "すべて",
            0: "クイズ",
            1: "ゲーム",
            2: "トークバラエティ",
            3: "お笑い・コメディ",
            4: "音楽バラエティ",
            5: "旅バラエティ",
            6: "料理バラエティ",
            15: "その他"
        },
        7: {
            16: "すべて",
            0: "洋画",
            1: "邦画",
            2: "アニメ",
            15: "その他"
        },
        8: {
            16: "すべて",
            0: "国内アニメ",
            1: "海外アニメ",
            2: "特撮",
            15: "その他"
        },
        9: {
            16: "すべて",
            0: "社会・時事",
            1: "歴史・紀行",
            2: "自然・動物・環境",
            3: "宇宙・科学・医学",
            4: "カルチャー・伝統文化",
            5: "文学・文芸",
            6: "スポーツ",
            7: "ドキュメンタリー全般",
            8: "インタビュー・討論",
            15: "その他"
        },
        10: {
            16: "すべて",
            0: "現代劇・新劇",
            1: "ミュージカル",
            2: "ダンス・バレエ",
            3: "落語・演芸",
            4: "歌舞伎・古典",
            15: "その他"
        },
        11: {
            16: "すべて",
            0: "旅・釣り・アウトドア",
            1: "園芸・ペット・手芸",
            2: "音楽・美術・工芸",
            3: "囲碁・将棋",
            4: "麻雀・パチンコ",
            5: "車・オートバイ",
            6: "コンピュータ・ＴＶゲーム",
            7: "会話・語学",
            8: "幼児・小学生",
            9: "中学生・高校生",
            10: "大学生・受験",
            11: "生涯教育・資格",
            12: "教育問題",
            15: "その他"
        },
        12: {
            16: "すべて",
            0: "高齢者",
            1: "障害者",
            2: "社会福祉",
            3: "ボランティア",
            4: "手話",
            5: "文字（字幕）",
            6: "音声解説",
            15: "その他"
        },
        13: {
            16: "すべて",
            15: "その他"
        },
        14: {
            16: "すべて",
            15: "その他"
        },
        15: {
            18: "すべて",
            0: "中止の可能性あり",
            1: "延長の可能性あり",
            2: "中断の可能性あり",
            3: "別話数放送の可能性あり",
            4: "編成未定枠",
            5: "繰り上げの可能性あり",
            14: "放送休止(仮)",
            16: "中断ニュースあり",
            17: "臨時サービスあり",
            32: "３Ｄ",
            63: "ジャンル未定義",
            64: "テニス",
            65: "バスケットボール",
            66: "ラグビー",
            67: "アメリカンフットボール",
            68: "ボクシング",
            69: "プロレス",
            79: "スポーツ:その他",
            80: "洋画:アクション",
            81: "洋画:SF/ファンタジー",
            82: "洋画:コメディー",
            83: "洋画:サスペンス/ミステリー",
            84: "洋画:恋愛/ロマンス",
            85: "洋画:ホラー/スリラー",
            86: "洋画:ウエスタン",
            87: "洋画:ドラマ/社会派ドラマ",
            88: "洋画:アニメーション",
            89: "洋画:ドキュメンタリー",
            90: "洋画:アドベンチャー/冒険",
            91: "洋画:ミュージカル/音楽映画",
            92: "洋画:ホームドラマ",
            93: "洋画:予備1",
            94: "洋画:予備2",
            95: "洋画:その他",
            96: "邦画:アクション",
            97: "邦画:SF/ファンタジー",
            98: "邦画:お笑い/コメディー",
            99: "邦画:サスペンス/ミステリー",
            100: "邦画:恋愛/ロマンス",
            101: "邦画:ホラー/スリラー",
            102: "邦画:青春/学園/アイドル",
            103: "邦画:任侠/時代劇",
            104: "邦画:アニメーション",
            105: "邦画:ドキュメンタリー",
            106: "邦画:アドベンチャー/冒険",
            107: "邦画:ミュージカル/音楽映画",
            108: "邦画:ホームドラマ",
            109: "邦画:予備1",
            110: "邦画:予備2",
            111: "邦画:その他"
        },
        16: {
            16: "すべて",
            15: "その他"
        }
    }

    export const getSubGenre = (genre: number, sub_code: number) => {
        if( sub_code == 16 ) { return "すべて"; }
        else if( sub_code == 15 ) { return "その他"; }
        else { return subGenreTable[genre][sub_code]; }
    }

    export const getAllSubGenre = () => {
        return subGenreTable;
    }
}

export default SubGenreModule;

